reports/showcase_aero/_w71a_wedge_probe/case_definition/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// P4 V71.A live-flip · M=2.0 inviscid 15-deg wedge (oblique shock).
// Apex at (0,0); wedge surface to (0.3048, 0.0817) => atan(0.0817/0.3048)=15.0deg.
// Top raised to y=0.35 so the beta=45.34deg shock (y=0.3085 at the outlet x=0.3048)
// EXITS THROUGH THE OUTLET and never touches the top symmetryPlane -> no reflected
// shock contaminates the wedge-surface post-shock average (DEC-V61-232 live slice).

scale   1;

vertices
(
    (-0.15242 0              -0.005)
    ( 0       0              -0.005)
    ( 0.3048  0.081670913853 -0.005)
    (-0.15242 0.35           -0.005)
    ( 0       0.35           -0.005)
    ( 0.3048  0.35           -0.005)

    (-0.15242 0               0.005)
    ( 0       0               0.005)
    ( 0.3048  0.081670913853  0.005)
    (-0.15242 0.35            0.005)
    ( 0       0.35            0.005)
    ( 0.3048  0.35            0.005)

);

blocks
(
    hex (0 1 4 3 6 7 10 9 ) (40 100 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (80 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    obstacle
    {
        type patch;
        faces
        (
            (1 2 8 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
